# Different way of creating the dataframe

In [1]:
import pandas as pd

# Import csv file 

df = pd.read_csv("E:\Python\B17.csv")
df

   Name  Market Cap  No.of.Shares  PE    Eps      Debt  Book Value
0   ITC   269686.78       1230.88  20  10.00      9.58       46.73
1    AP    41153.54        385.69   0  -0.59  14371.57       40.70
2    TM    99874.86        332.00   0 -26.84  25444.77       45.30
3  Info   576659.14        426.07  32  41.44      0.00      156.89
4   Tcs  1173989.84        375.00  37  82.65      0.00      222.10

In [3]:
# Import xlsx file

df = pd.read_excel("E:\Python\B17.1.xlsx","B17")
df

   Name  Market Cap  No.of.Shares  PE    Eps      Debt  Book Value
0   ITC   269686.78       1230.88  20  10.00      9.58       46.73
1    AP    41153.54        385.69   0  -0.59  14371.57       40.70
2    TM    99874.86        332.00   0 -26.84  25444.77       45.30
3  Info   576659.14        426.07  32  41.44      0.00      156.89
4   Tcs  1173989.84        375.00  37  82.65      0.00      222.10

In [4]:
# import dictinary 

weather_data = {
    'day': ['1/1/2017','1/2/2017','1/3/2017'],
    'temperature': [32,35,28],
    'windspeed': [6,7,2],
    'event': ['Rain', 'Sunny', 'Snow']
}
df = pd.DataFrame(weather_data)
df

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow

In [11]:
# import tuple list
weather_data = [
    ('1/1/2017',32,6,'Rain'),
    ('1/2/2017',35,7,'Sunny'),
    ('1/3/2017',28,2,'Snow')
]
df = pd.DataFrame(weather_data, columns=['day','temperature','windspeed','event'])
df

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow

In [12]:
# List of Dictionary

weather_data = [
    {'day': '1/1/2017', 'temperature': 32, 'windspeed': 6, 'event': 'Rain'},
    {'day': '1/2/2017', 'temperature': 35, 'windspeed': 7, 'event': 'Sunny'},
    {'day': '1/3/2017', 'temperature': 28, 'windspeed': 2, 'event': 'Snow'},
    
]
df = pd.DataFrame(weather_data)
df

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow